import Style from "./Style";
// import { useRef } from "react";

export default function WhitePaper() {
  // const RootDom = useRef<HTMLElement | null>(null);

  // useEffect(() => {
  //   RootDom.current = document.getElementById("root");
  // }, []);

  // useEffect(() => {
  //   if (RootDom.current) {
  //     RootDom.current.scrollTo({
  //       top: 0,
  //       behavior: "smooth",
  //     });
  //   }
  // }, []);

  return (
    <Style>
      <div className="topic">白皮书</div>
      <div className="title">摘要</div>
      <div className="des">
        1992年，Neal Stephenson的科幻⼩说《SnowSNO W.Crash》中提出了“metaverse”
        这个概
        念，书中情节发⽣在⼀个现实⼈类通过VR设备与虚拟⼈共同⽣活在⼀个虚拟空间的未来设定中，⼩说
        中的元宇宙⽤⼾可以通过虚拟现实眼镜（VRGlasses）进⼊到虚拟世界，男主因为搭救在元宇宙中被
        计算机病毒“雪崩”伤害导致现实中脑部遭受重创的朋友和避免现实世界被数字病毒摧毁⽽潜⼊邪教
        内部，找到了解药阻⽌了雪崩病毒对于现实的毁灭性打击，并且阻⽌了病毒在元宇宙中传播的故事。
        因为这部天⻢星空的赛伯朋克作品，很多⼈认为1992年是元宇宙的元年；新冠疫情隔离政策下，全社
        会上⽹时⻓Second L
        ife⼤幅增⻓，“宅经济”快速发展⽽虚拟世界拥有更强的世界编辑功能与发达
        的虚拟经济系统；疫情加速社会虚拟化。
      </div>
      <div className="title">一、什么是元宇宙</div>
      <div className="des">
        元宇宙是整合多种新技术⽽产⽣的新型虚实相隔的互联⽹应⽤和社会形态，它基于扩展现实技术提供
        沉浸式体验，基于数字孪⽣技术⽣成现实世界的镜像，基于区块链技术搭建经济体系，将虚拟世界与
        现实世界在经济系统、社交系统、⾝份系统上密切融合，并且允许每个⽤⼾进⾏内容⽣产和世界编辑
      </div>
      <div className="title">元宇宙核⼼特征：</div>
      <div className="des">
        虚拟社会规则 <br />
        沉浸式体验 <br />
        虚拟经济 <br />
        虚拟⾝份
      </div>
      <div className="title">
        ⼆、Mountain Sea World基于多链协议的综合型元宇宙游戏平台
      </div>
      <div className="des"> </div>
      <div className="title">一、什么是元宇宙</div>
      <div className="des">
        <div>
          从传统的 RPG 桌游到 AAA 开放世界，游戏从来都
          不是单纯的娱乐，⽽是玩家围绕有限资源进⾏竞争
          的平台。因此，具有流通价值和使⽤价值的游戏币在游戏的⽤⼾留存和商业周期中起着⾄关重要的作
          ⽤，作为游戏与加密货币结合的产物，GameFi 项⽬的 tokenomics
          ⾃然适合作为游戏经济的⼀部分
          将游戏资产的交易从灰⾊地带带到了光明的天空
          ，给予玩家前所未有的物品所有权和交易权。
        </div>
        <div>
          究竟怎样的 tokenomics 能够让GameFi 系统更稳定更持久，有没有⼀种
          经济机制能让元宇宙游戏系 统⽆限接近WAB2游戏， Mountain Sea World
          正是为这⼀伟⼤的使命和梦想⽽设⽴的探索性且⾰命
          性的尝试，我们希通过安全公开、跨链⽣态、游戏矩阵、沉浸式体验、强社交属性、多游戏资产互通
          等玩法来打造玩法丰富的链游平台。
        </div>
        <div>
          在第⼀个阶段，游戏会通过有趣的剧情代⼊让玩家和社区使⽤区块链技术创造出数字世界的关键因素
          并在游戏中使⽤这些因素，每个因素都将⽤去中⼼化的⽅式以及区块链技术来打造，让这个数字世界
          真正属于每⼀个参与游戏的玩家！
        </div>
        <div>
          传统游戏体验主要是单⼀的、固定的体验，不同的游戏之间相互隔离各⾃形成⼩的封闭系统，游戏中
          的道具资源⼏乎不能互转，Web3游戏的出现为这种变⾰的可⾏性提供了基础，在第⼆阶段⼭海世界将
          通过打造游戏矩阵成为⼀个可组合性、可互操性的游戏发型平台增强社交属性以及连接不同⽣态，在
          不同的发展时期，我们将有完全不⼀样的游戏体验
        </div>
      </div>
      <div className="title">当前区块链游戏的痛点</div>
      <div className="tag">较⾼的⾏业壁垒</div>
      <div className="des">
        元宇宙涉及的领域诸如区块链、⼈⼯智能、脑机接⼝、⼤数据、5G等都有较⾼的科技含量，并⾮⼈⼈
        都可以参与。
      </div>
      <div className="tag">复杂的买卖流程</div>
      <div className="des">
        当前元宇宙和链游因为跨链和不兼容的问题，导致游戏内NFT、道具、代币的买卖流程不通畅，玩家
        经常需要在不同平台之间切换和交易。
      </div>
      <div className="tag">玩家很难真正从游戏中收益</div>
      <div className="des">
        虽然各个链游都宣称玩家获得了不错的收益，但这仅限于早期⽤⼾这也造成游戏的中后期⽤⼾增⻓动
        ⼒不⾜。
      </div>
      <div className="tag">不可避免的死亡螺旋</div>
      <div className="des">
        ⽆论是DeFi,还是GameFi,
        项⽬都不可避免发⽣死亡螺旋的窘境，这使得项⽬的发展受到严重的威胁，
        ⼀旦代币和游戏内资产遭遇死亡螺旋，玩家⼀定会争先恐后抛售⼿上的资产，这对游戏的发展⾮常不
        利。
      </div>
      <div className="tag">当前链游博弈机制不完善</div>
      <div className="des">
        当前的链游⼤部分都是从游戏系统中获益，很少能从其他玩家⼿中获益，这造成⼤部分的游戏玩家和
        系统对⽴的局⾯。
      </div>
      <div className="tag">当前链游难以出圈</div>
      <div className="des">
        完整的游戏世界观、游戏背景、剧情、玩家互动是⼀个游戏不可或缺的主要因素，当前链游过分追求
        经济收⼊，⽽忽略了⼀个能称之为游戏的产品的主要因素，这⼏乎剥夺了游戏⽣命线，使游戏缺乏趣
        味性，传统消费型游戏玩家难以进⼊，导致链游平台⽅⽆法获得消费型收⼊、⽣命周期短等⼀系列问
        题。
      </div>
      <div className="tag">当前链游游戏资产并不完全属于个⼈</div>
      <div className="des">
        在区块链游戏中，虽然游戏道具完全属于个⼈所有，但是游戏道具的价值取决于游戏的发展⽔平，⼀
        旦某个游戏破产，也意味着这个游戏的玩家只是拥有⼀串不值钱的代码⽽已，游戏发⾏⽅打着游戏财
        产属于个⼈的旗号实施着侵吞玩家资产的事实。
      </div>
      <div className="tag">经济模型缺点明显</div>
      <div className="des">
        单币模型 <br />
        VST（可变供应） <br />
        优势 <br />
        可以根据游戏玩家量、道具交易量增加或者减少代币的供应量，防⽌游戏过度投机对游戏玩家造成的
        ⽆常损耗。 <br />
        缺点
        <br />
        由于供应量不固定导致外来资本很难进⼊，不利于融资和⼆级市场交
        易，因此对游戏玩家的素质和游 戏的趣味性要求极⾼。
        <br />
        FST(固定供应)
        <br />
        优势
        <br />
        代币总量是固定的，因此较容易获得投资⽅的投资和⼆级市场的进
        ⼊，对项⽬⽅的⾦融背景要求相对 较低。
        <br />
        缺点 <br />
        任何游戏都会⾯临流量衰退的现象，如果⼀旦出现资本获利套现，
        ⼆级市场参与者离场，就会造成代
        币价格下降，对游戏玩家⽽⾔就要忍受前期游戏道具价格暴涨，参与⻔槛极⾼，后期游戏道具价格暴
        跌所造成的 ⽆常损失，⾮常不利于游戏⻓远发展。
        <br />
        双币模型
        <br />
        FST+VST <br />
        优势 <br />
        双币模式的优势是将投机和游戏经济分离，FST(固定供应)代币可以让⼈们进⾏投机，VST（可变供
        应）代币可以让⼈们玩游戏，这样投机活动的激增不会导致游戏内价格的飙升，⽽且采⽤FST(固定供
        应代币)进 ⾏融资也利于资本进⼊。
        <br />
        缺点
        <br />
        FST(固定供应)代币⽬前没有什么应⽤场景，很难为代币赋能，仅仅作为治理代币进⾏⼆级市场投机，
        这是典型的⾦融永动机概念，任何⼀
        款游戏都是前期⽕热，当投机⻛过去之后，代币价格下降，很容
        易对游戏玩家产⽣动摇，如果⼀旦不能维持平衡极易造成死亡螺旋，从⽽造成游戏经济系统坍塌。
      </div>
      <div className="tag">当前链游难以出圈</div>
      <div className="des">
        完整的游戏世界观、游戏背景、剧情、玩家互动是⼀个游戏不可或缺的主要因素，当前链游过分追求
        经济收⼊，⽽忽略了⼀个能称之为游戏的产品的主要因素，这⼏乎剥夺了游戏⽣命线，使游戏缺乏趣
        味性，传统消费型游戏玩家难以进⼊，导致链游平台⽅⽆法获得消费型收⼊、⽣命周期短等⼀系列问
        题。
      </div>
      <div className="title">我们的解决⽅案</div>
      <div className="tag">跨链游戏平台</div>
      <div className="des">
        我们将打造跨链解决⽅案，提升玩家游戏资产的交易效率，降低交易费⽤，让玩家可以在不同区块链
        ⽹络上⾃由切换。构建链游界Steam，吸引破圈⽤⼾、⾮链⽤⼾、降低传统游戏玩家参与⻔槛，在加
        密⾏业监管合规的国家和地区，实现法币与代币的⾃由流通。
        进⽽打造全链属性，Web2/Web3⾼互通性，游戏和⾦融完美融合的游戏专属平台链。
      </div>
      <div className="tag">新的游戏经济模型</div>
      <div className="des">
        在⼭海世界中，我们⾮常注重维护⼀个活跃且平衡的经济系统。 我们同时
        希望在这样的虚拟世界中设 计以及试验该经济模型能给现实中的世界带来 ⼀
        种价值和启发。 我们⼀直在探索有没有⼀种⽅法既能
        两者兼顾，⼜能维护游戏经济系统的稳定。 <br />
        我们认为这⾥需要⼀种第三⽅的⼒量介⼊才能既满⾜玩家的投资需求，同时⼜能保持游戏经济系统的
        稳定运⾏，因此⼭海世界采⽤了第三种
        经济系统即⺟币+FST(固定供应)代币的经济体系。
        <br />
        <div style={{ padding: "0 0 0 1.25rem" }}>
          ⼭海世界是基于BSC链开发的{" "}
          <span>
            多⼈在线解密、NFT故事驱动、创新性多⼈在线解密、NFT故事驱
            动、开放世界区块链创新性游戏
          </span>{" "}
          ，因此游戏经济系统采⽤BNB+MSW的模型 游戏主要道具⼀律采
          ⽤BNB交易，消耗型⾮主要道具采⽤代币MSW交易
          ，这样即保证了在市场⽕热的情况下不会因为
          过度投机对游戏主要经济造成冲击，游戏内MSW代币也有了消耗场景，保证了市场玩家的投机需
          求
          ，且通过游戏赚取代币，形成产销⼀体，从经济体系上保证了游戏⻓远稳定的运⾏。
        </div>
      </div>
      <div className="tag">打造⼭海世界游戏矩阵</div>
      <div className="des">
        任何⾏业都有⽣命周期，链游也⼀样，⼀旦⼀款链游的⽣命周期⾛到尽头，那么它将不可避免的成为
        ⼀款纯产出游戏，⼭海世界的主创团队认为在未来，元宇宙⼀定是多元和互联的⽽不是现在的独⽴闭
        塞的，在多元宇宙阶段我们将会引⼊更多更丰富的游戏世界
        以独创的“宇宙穿梭”式机制接⼊进我们
        的数字宇宙，让玩家可以⾃由的从数字宇宙穿梭到其他游戏世界进⾏游玩，并且实现资源与经济互通
        的时代。
        <br />
        因此我们希望让不同的游戏资产以及道具可以互通，从根本上解决孤岛效应，很显然单⼀的⼀款游戏
        根本⽆法解决，这也说明成为⼀家游戏平台的必要性，我们希望从互通性、互操性游戏可编辑性等⽅
        ⾯解决上述问题，但是直接以平台⾯对玩家的代⼊感并不是很强，玩家的参与感较低，因此我们希望
        通过⼀款游戏切⼊玩家，并将玩家进⾏升级，完成平台的初步流量切⼊。
      </div>
      <div className="tag">打造链游1.5</div>
      <div className="des">
        Mountain Sea World
        是第⼀款拥有完整的世界背景、丰富的游戏场景、完整的游戏剧情、超强游戏
        社交的⾼趣味性以《⼭海经》为背景的解密类链游，通过完整的剧情带⼊，增加玩家的沉浸式体验感
        并以此纯吸引消费型玩家的进⼊增强游戏经济系统。
      </div>
      <div className="tag">其他优势</div>
      <div className="des">
        游戏⾝份 <br />
        玩家只需要持有NFT便能⾃由穿梭⼭海世界基⾦会旗下的任何游戏，⽆需重新注册和建档。
        <br />
        好友关系
        <br />
        好友关系和玩家⾝份之间采⽤灵魂绑定代币（SBT）进⾏绑定，因此玩家可以⽅便的把通讯录从⼀款
        游戏带⼊下⼀款游戏，增强社交属性。
        <br />
        ⼴告植⼊
        <br />
        鉴于我们需要玩家在线互动，在这个开放的⼤世界中，我们预期将会有⾮常多的玩家同时在线，这将
        是⼀个⾮常好的宣传时机；因此，
        我们将会提供途径给合作⽅以彩蛋和游戏攻略的形式进⾏合理的⼴ 告宣传。
      </div>
      <div className="title">
        三、Mountain Sea World 基于BSC链上的第⼀款以《⼭海经》为蓝本的
        多⼈在线解密NFT故事驱动类游戏
      </div>
      <div className="tag">Mountain Sea World 游戏背景</div>
      <div className="des">
        鲲是⼀种⾼纬度⽣物，突破了时间、空间、距离的限制，它们拥有⾮常精准的时间锚点，它们可以⾃
        由控制⾝躯⼤⼩、可⾃由穿梭、演变低纬度星球发现合适的能量；它们可⾃由变化，或显现于宇宙之
        内，或藏⾝于尘埃之中，它们拥有不同的形态，有⾝穿机甲强化⼰⾝的机甲形，也有受到⿊暗侵蚀的
        丧⼫形......
        <br />
        在异空间裂缝中曾经的⼀批鲲是促进星球演化的鲲，由于狂躁派逐步占领上⻛，巨⼤的破坏使这⽚世
        界失去了明天，在这个资源匮乏的颓废世界，由于本能的掠夺天性，剩余的鲲在扭曲腐烂的贪婪驱使
        下让这⽚世界没有了可持续性发展，逐步沦为废星，秩序破碎下派系林⽴，少部分被遗弃的鲲，拾起
        灵魂⽕种，踏上⾃我拯救的返途，它们的每次抉择必将影响废星未来，全新的时间线到底是在这末⽇
        的废⼟中重建秩序、唤醒星球的本来能⼒，还是找到更适合鲲的⽣存空间......
      </div>
      <div className="tag red" style={{ fontWeight: "bold" }}>
        Mountain Sea World 游戏特点
      </div>
      <div className="des red">
        丰富的剧情⽀撑 <br />
        线稿插图攻略 <br />
        ⽂字剧本NFT
        <br />
        根据每只鲲的部位构成元素，构建了游戏剧情丰富的变量。 <br />
        多⼈在线解密模式
        <br />
        ⾼⾃由度，随机关卡、剧情和怪物。
        <br />
        开放性，每⼀个玩家的选择，会影响公会内其他剧情⾛向；
        <br />
        随机性，GAS费与游戏规则结合他⼈⽀付了GAS费，居然影响了⾃⼰，倒霉和惊喜，都告诉你不曾被遗
        忘。
        <br />
        ⼤逃杀，某个条件把⼀⼤群玩家触发到⼀个独⽴场景，让他们相互淘汰，每个⼈的解密进度，会直接
        压缩其他玩家的可选项。
      </div>
      <div className="tag">Mountain Sea World 游戏主要道具</div>
      <div className="des">
        鲲NFT（初始属性需要数值） <br />
        <br />
        R:绿⾊鲲，总量50万张 <br />
        属性 <br />
        战⽃值 <br />
        体⼒值 <br />
        抵抗值 <br />
        幸运值 <br />
        灵魂值 <br />
        <br />
        SR:蓝⾊鲲，总量10万张 <br />
        属性 <br />
        战⽃值 <br />
        体⼒值 <br />
        抵抗值 <br />
        幸运值 <br /> 灵魂值 <br />
        <br />
        SSR：粉⾊鲲，总量1000张 <br />
        属性 <br />
        战⽃值 <br />
        体⼒值 <br />
        抵抗值 <br />
        幸运值 <br /> <br />
        灵魂值 SSS：橙⾊鲲，总量200张 <br /> 属性 <br />
        战⽃值 <br />
        体⼒值 <br />
        抵抗值 <br />
        幸运值 <br />
        灵魂值 <br />
        <br />
        鲲NFT属性 <br />
        战⽃值 <br /> 体⼒值 <br /> 抵抗值 <br /> 幸运值 <br /> 灵魂值 <br />
        <br />
        宝⽯NFT <br />
        勇⽓宝⽯ ：影响鲲的战⽃属性 <br />
        体⼒宝⽯ ：影响鲲的体⼒属性 <br />
        抵抗宝⽯ ：影响鲲的防御属性 <br />
        幸运宝⽯：影响鲲的幸运属性 <br />
        灵魂宝⽯：影响鲲的精⼒属性 <br />
        <br />
        勋章NFT <br />
        战⽃印记 <br />
        宝藏印记 <br />
        <br />
        宝箱NFT <br />
        普通宝箱 <br /> 精良宝箱 <br /> 发光宝箱 <br />
        神鲲宝箱
      </div>
      <div className="title">
        Mountain Sea World 游戏道具的分类、⽣产以及消耗
      </div>
      <div className="tag">剧情NFT游戏攻略宝箱</div>
      <div className="tag">Ⅰ类道具</div>
      <div className="tag">鲲NFT</div>
      <div>
        <table border={1}>
          <tr>
            <th>品质</th>
            <th>R</th>
            <th>SR</th>
            <th>SSR</th>
            <th>SSS</th>
          </tr>
          <tr>
            <td>总量</td>
            <td>50万</td>
            <td>10万</td>
            <td>1000</td>
            <td>200</td>
          </tr>
          <tr>
            <td>产出</td>
            <td>
              盲盒销售 <br />
              宝箱获得 <br />
              捕兽活动
            </td>
            <td>
              盲盒销售 <br />
              游戏合成 <br />
              捕兽活动
            </td>
            <td>游戏合成</td>
            <td>游戏合成</td>
          </tr>
        </table>
      </div>
      <div className="tag">宝石NFT</div>
      <div>
        <table border={1}>
          <tr>
            <th>品质</th>
            <th>初级宝石</th>
            <th>中级宝石</th>
            <th>高级宝石</th>
          </tr>
          <tr>
            <td>产出</td>
            <td>
              普通宝箱 <br />
              精良宝箱 <br />
              发光宝箱 <br />
              系统奖励 <br />
              寻宝获得 <br />
              战⽃获得
            </td>
            <td>
              精良宝箱 <br />
              发光宝箱 <br />
              系统奖励 <br />
              寻宝获得 <br />
              战⽃获得 <br />
              宝⽯合成
            </td>
            <td>
              发光宝箱 <br />
              神鲲宝箱 <br />
              系统奖励 <br />
              寻宝获得 <br />
              战⽃获得 <br />
              宝⽯合成
            </td>
          </tr>
        </table>
      </div>
      <div className="tag">Ⅱ类道具</div>
      <div className="tag">宝箱NFT</div>
      <div>
        <table border={1}>
          <tr>
            <th>宝箱分类</th>
            <th>R</th>
            <th>SR</th>
            <th>SSR</th>
            <th>SSS</th>
          </tr>
          <tr>
            <td>总量</td>
            <td>50万</td>
            <td>10万</td>
            <td>1000</td>
            <td>200</td>
          </tr>
          <tr>
            <td>产出</td>
            <td>
              盲盒销售 <br />
              宝箱获得 <br />
              捕兽活动
            </td>
            <td>
              盲盒销售 <br />
              游戏合成 <br />
              捕兽活动
            </td>
            <td>游戏合成</td>
            <td>游戏合成</td>
          </tr>
        </table>
      </div>
    </Style>
  );
}
